package pl.allegro.finance.tradukisto.internal.languages.bangla

import spock.lang.Specification
import spock.lang.Unroll

import static pl.allegro.finance.tradukisto.internal.Container.banglaContainer

class BanglaValuesTest extends Specification {

    static intConverter = banglaContainer().getIntegerConverter()
    static longConverter = banglaContainer().getLongConverter()
    
    @Unroll
    def "should convert #value to '#words' in Bangla"() {
        expect:
        intConverter.asWords(value) == words

        where:
        value             | words
        0                 | "শূন্য"
        1                 | "এক"
        2                 | "দুই"
        3                 | "তিন"
        4                 | "চার"
        5                 | "পাঁচ"
        6                 | "ছয়"
        7                 | "সাত"
        8                 | "আট"
        9                 | "নয়"

        11                | "এগারো"
        12                | "বারো"
        13                | "তেরো"
        14                | "চৌদ্দ"
        15                | "পনেরো"
        16                | "ষোল"
        17                | "সতেরো"
        18                | "আঠারো"
        19                | "ঊনি"

        10                | "দশ"
        20                | "বিশ"
        30                | "ত্রিশ"
        40                | "চল্লিশ"
        50                | "পঞ্চাশ"
        60                | "ষাট"
        70                | "সত্তর"
        80                | "আশি"
        90                | "নব্বই"

        21                | "একুশ"
        37                | "সাতত্রিশ"
        43                | "তেতাল্লিশ"
        58                | "আটাষি"
        69                | "ঊনষাট"
        76                | "ছিয়াত্তর"
        82                | "বিরাশি"
        95                | "পঁচানব্বই"

        100               | "একশো"
        200               | "দুইশো"
        300               | "তিনশো"
        400               | "চারশো"
        500               | "পাঁচশো"
        600               | "ছয়শো"
        700               | "সাতশো"
        800               | "আটশো"
        900               | "নয়শো"

        101               | "একশ এক"
        111               | "একশ এগারো"
        272               | "দুই শো বাহাত্তর"
        387               | "তিনশো সাতাশি"
        421               | "চারশো একুশ"
        448               | "চারশো আটচল্লিশ"
        569               | "পাঁচশো ঊনসত্তর"
        625               | "ছয়শো পঁচিশ"
        782               | "সাত শো বিরাশি"
        895               | "আট শো পঁচানব্বই"
        999               | "নয় শো নিরানব্বই"

        1_000             | "এক হাজার"
        2_000             | "দুই হাজার"
        3_000             | "তিন হাজার"
        4_000             | "চার হাজার"
        5_000             | "পাঁচ হাজার"
        11_000            | "এগারো হাজার"
        12_000            | "বারো হাজার"
        13_000            | "তেরো হাজার"
        14_000            | "চৌদ্দ হাজার"
        15_000            | "পনের হাজার"
        21_000            | "একুশ হাজার"

        7_634             | "সাত হাজার ছয় শো চৌত্রিশ"
        24_190            | "চব্বিশ হাজার এক শোনব্বই"
        99_999            | "নিরানব্বই হাজার নয় শো নিরানব্বই"

        111_000           | "এক লাখ এগারো হাজার"
        112_000           | "এক লাখ বারো হাজার"
        113_000           | "এক লাখ তেরো হাজার"
        115_000           | "এক লাখ পনেরো হাজার"
        700_000           | "সাত লাখ"
        653_000           | "ছয় লাখ তিপ্পান্ন হাজার"

        123_454           | "এক লাখ তেইশ হাজার চার শো চুয়ান্ন"
        999_999           | "নয় লাখ নিরানব্বই হাজার নয় শো নিরানব্বই"

        1_000_000         | "এক মিলিয়ন"
        2_000_000         | "দুই মিলিয়ন"
        5_000_000         | "পাঁচ মিলিয়ন"
        11_437_219        | "এক কোটি চৌদ্দ লাখ সাইত্রিশ হাজার দুই শো ঊনিশ"
        21_437_219        | "দুই কোটি চৌদ্দ লাখ সাইত্রিশ হাজার দুই শো ঊনিশ"
        22_437_219        | "দুই কোটি চব্বিশ লাখ সাইত্রিশ হাজার দুই শো ঊনিশ"
        23_437_219        | "দুই কোটি চৌত্রিশ লাখ সাইত্রিশ হাজার দুই শো ঊনিশ"
        100_000_000       | "দশ কোটি"
        121_000_000       | "বারো কোটি দশ লাখ"
        121_451_789       | "বারো কোটি চৌদ্দ লাখ একান্ন হাজার সাত শো ঊননব্বই"
        123_456_789       | "বারো কোটি চৌত্রিশ লাখ ছাপ্পান্ন হাজার সাত শো ঊননব্বই"

        1_000_000_000     | "এক বিলিয়ন"
        2_141_123_731     | "দুইশো চৌদ্দ বিলিয়ন এগারো লাখ তেইশ হাজার সাত শো একত্রিশ"
        Long.MAX_VALUE    | "দুই বিলিয়ন একশ সাতচল্লিশ মিলিয়ন চারশত তিরিশ হাজার ছয়শ সাতচল্লিশ"
    }

    @Unroll
    def "should convert long #value to '#words' in Bangla"() {
        expect:
        longConverter.asWords(value) == words

        where:
        value                     | words
        5_000_000_000             | "পাঁচ বিলিয়ন"

        1_000_000_000_000         | "এক ট্রিলিয়ন"
        2_000_000_000_000         | "দুই ট্রিলিয়ন"
        5_000_000_000_000         | "পাঁচ ট্রিলিয়ন"

        1_000_000_000_000_000     | "এক কোয়াড্রিলিয়ন"
        2_000_000_000_000_000     | "দুই কোয়াড্রিলিয়ন"
        5_000_000_000_000_000     | "পাঁচ কোয়াড্রিলিয়ন"

        1_000_000_000_000_000_000 | "দশ লক্ষের পঞ্চঘাত"
        2_000_000_000_000_000_000 | "বিশ লক্ষের পঞ্চঘাত"
        Long.MAX_VALUE            | "নয় ট্রিলিয়ন দুইশত তেইশ বিলিয়ন তিনশত বাহাত্তর ট্রিলিয়ন ছত্রিশ বিলিয়ন আটশত পঞ্চাশ চার কোটি সাতশত পঁচাত্তর হাজার আটশত সাত"
    }
}