package pl.allegro.finance.tradukisto.internal.languages.greek

import spock.lang.Specification
import spock.lang.Unroll

import static pl.allegro.finance.tradukisto.internal.Container.greekContainer

class GreekValuesTest extends Specification {

    static intConverter = greekContainer().getIntegerConverter()
    static longConverter = greekContainer().getLongConverter()

    @Unroll
    def "should convert #value to '#words' in Greek"() {
        expect:
        intConverter.asWords(value) == words

        where:
        value         | words
        0             | "μηδέν"
        1             | "ένα"
        2             | "δύο"
        3             | "τρία"
        4             | "τέσσερα"
        5             | "πέντε"
        6             | "έξι"
        7             | "επτά"
        8             | "οκτώ"
        9             | "εννέα"

        11            | "έντεκα"
        12            | "δώδεκα"
        13            | "δεκατρία"
        14            | "δεκατέσσερα"
        15            | "δεκαπέντε"
        16            | "δεκαέξι"
        17            | "δεκαεπτά"
        18            | "δεκαοκτώ"
        19            | "δεκαεννέα"

        10            | "δέκα"
        20            | "είκοσι"
        30            | "τριάντα"
        40            | "σαράντα"
        50            | "πενήντα"
        60            | "εξήντα"
        70            | "εβδομήντα"
        80            | "ογδόντα"
        90            | "ενενήντα"

        21            | "είκοσι ένα"
        37            | "τριάντα επτά"
        43            | "σαράντα τρία"
        58            | "πενήντα οκτώ"
        69            | "εξήντα εννέα"
        76            | "εβδομήντα έξι"
        82            | "ογδόντα δύο"
        95            | "ενενήντα πέντε"

        100           | "εκατό"
        200           | "διακόσια"
        300           | "τριακόσια"
        400           | "τετρακόσια"
        500           | "πεντακόσια"
        600           | "εξακόσια"
        700           | "επτακόσια"
        800           | "οκτακόσια"
        900           | "εννιακόσια"

        111           | "εκατόν έντεκα"
        272           | "διακόσια εβδομήντα δύο"
        387           | "τριακόσια ογδόντα επτά"
        448           | "τετρακόσια σαράντα οκτώ"
        569           | "πεντακόσια εξήντα εννέα"
        625           | "εξακόσια είκοσι πέντε"
        782           | "επτακόσια ογδόντα δύο"
        895           | "οκτακόσια ενενήντα πέντε"
        999           | "εννιακόσια ενενήντα εννέα"

        1_000         | "χίλια"
        2_000         | "δύο χιλιάδες"
        3_000         | "τρεις χιλιάδες"
        4_000         | "τέσσερις χιλιάδες"
        5_000         | "πέντε χιλιάδες"
        7_634         | "επτά χιλιάδες εξακόσια τριάντα τέσσερα"
        11_000        | "έντεκα χιλιάδες"
        15_000        | "δεκαπέντε χιλιάδες"
        21_000        | "είκοσι μία χιλιάδες"
        24_190        | "είκοσι τέσσερις χιλιάδες εκατόν ενενήντα"
        653_000       | "εξακόσιες πενήντα τρεις χιλιάδες"
        123_454       | "εκατόν είκοσι τρεις χιλιάδες τετρακόσιες πενήντα τέσσερις"
        700_000       | "επτακόσιες χιλιάδες"
        999_999       | "εννιακόσιες ενενήντα εννέα χιλιάδες εννιακόσιες ενενήντα εννέα"

        1_000_000     | "ένα εκατομμύριο"
        2_000_000     | "δύο εκατομμύρια"
        5_000_000     | "πέντε εκατομμύρια"
        23_437_219    | "είκοσι τρία εκατομμύρια τετρακόσιες τριάντα επτά χιλιάδες διακόσιες δεκαεννέα"


        2_147_483_647 | "δύο δισεκατομμύρια εκατόν σαράντα επτά εκατομμύρια τετρακόσιες ογδόντα τρεις χιλιάδες εξακόσια " +
                "σαράντα επτά"
    }

    @Unroll
    def "should convert long #value to '#words' in Greek"() {
        expect:
        longConverter.asWords(value) == words

        where:
        value                             | words
        5_000_000_000                     | "πέντε δισεκατομμύρια"

        1_000_000_000_000_000             | "ένα τρισεκατομμύριο"
        2_000_000_000_000_000             | "δύο τρισεκατομμύρια"
        5_000_000_000_000_000             | "πέντε τρισεκατομμύρια"

        1_000_000_000_000_000_000         | "ένα τετράκις εκατομμύριο"
        2_000_000_000_000_000_000_000     | "δύο τετράκις εκατομμύρια"
        5_000_000_000_000_000_000_000     | "πέντε τετράκις εκατομμύρια"

        1_000_000_000_000_000_000_000_000 | "ένα πεντάκις εκατομμύριο"
        2_000_000_000_000_000_000_000_000 | "δύο πεντάκις εκατομμύρια"
        Long.MAX_VALUE                    | "nine quintillion two hundred twenty-three quadrillion " +
                "τριακόσια εβδομήντα δύο τρισεκατομμύρια τριάντα έξι δισεκατομμύρια " +
                "οκτακόσια πενήντα τέσσερα εκατομμύρια επτακόσιες εβδομήντα πέντε χιλιάδες " +
                "eight hundred seven"
    }
}
