package pl.allegro.finance.tradukisto.internal.languages.kyrgyz

import spock.lang.Ignore
import spock.lang.Specification
import spock.lang.Unroll

import static pl.allegro.finance.tradukisto.internal.Container.kyrgyzContainer

class KyrgyzValuesTest extends Specification {

    static intConverter = kyrgyzContainer().getIntegerConverter()
    static longConverter = kyrgyzContainer().getLongConverter()

    @Unroll
    def "should convert #value to '#words' in Kazakh"() {
        expect:
        intConverter.asWords(value) == words

        where:
        value         | words

        0             | "нөл"
        1             | "бир"
        2             | "эки"
        3             | "үч"
        4             | "төрт"
        5             | "беш"
        6             | "алты"
        7             | "жети"
        8             | "сегиз"
        9             | "тогуз"
        10            | "он"

        11            | "он бир"
        12            | "он эки"
        13            | "он үч"
        14            | "он төрт"
        15            | "он беш"
        16            | "он алты"
        17            | "он жети"
        18            | "он сегиз"
        19            | "он тогуз"

        20            | "жыйырма"
        30            | "отуз"
        40            | "кырк"
        50            | "элүү"
        60            | "алтымыш"
        70            | "жетимиш"
        80            | "сексен"
        90            | "токсон"
        100           | "жүз"

        200           | "эки жүз"
        300           | "үч жүз"
        400           | "төрт жүз"
        500           | "беш жүз"
        600           | "алты жүз"
        700           | "жети жүз"
        800           | "сегиз жүз"
        900           | "тогуз жүз"
        1000          | "бир миң"

        1_000_000     | "бир миллион"
        1_000_000_000 | "бир миллиард"

        25            | "жыйырма беш"
        34            | "отуз төрт"
        51            | "элүү бир"
        89            | "сексен тогуз"
        144           | "жүз кырк төрт"
        233           | "эки жүз отуз үч"
        377           | "үч жүз жетимиш жети"
        610           | "алты жүз он"
        987           | "тогуз жүз сексен жети"
        1_597         | "бир миң беш жүз токсон жети"
        2_584         | "эки миң беш жүз сексен төрт"
        4_181         | "төрт миң жүз сексен бир"
        6_765         | "алты миң жети жүз алтымыш беш"
        10_946        | "он миң тогуз жүз кырк алты"
        17_711        | "он жети миң жети жүз он бир"
        28_657        | "жыйырма сегиз миң алты жүз элүү жети"
        46_368        | "кырк алты миң үч жүз алтымыш сегиз"
        75_025        | "жетимиш беш миң жыйырма беш"
        121_393       | "жүз жыйырма бир миң үч жүз токсон үч"
        196_418       | "жүз токсон алты миң төрт жүз он сегиз"
        317_811       | "үч жүз он жети миң сегиз жүз он бир"
        514_229       | "беш жүз он төрт миң эки жүз жыйырма тогуз"
        832_040       | "сегиз жүз отуз эки миң кырк"
        1_346_269     | "бир миллион үч жүз кырк алты миң эки жүз алтымыш тогуз"
        2_178_309     | "эки миллион жүз жетимиш сегиз миң үч жүз тогуз"

        1_836_311_903 | "бир миллиард сегиз жүз отуз алты миллион үч жүз он бир миң тогуз жүз үч"
    }

    @Ignore("Needs kyrgyz long converter and values for trillion, quadrillion, quintillion")
    @Unroll
    def "should convert long #value to '#words' in Kyrgyz"() {
        expect:
        longConverter.asWords(value) == words

        where:
        value                     | words
        5_000_000_000             | ""

        1_000_000_000_000         | ""
        2_000_000_000_000         | ""
        5_000_000_000_000         | ""

        1_000_000_000_000_000     | ""
        2_000_000_000_000_000     | ""
        5_000_000_000_000_000     | ""

        1_000_000_000_000_000_000 | ""
        2_000_000_000_000_000_000 | ""
        Long.MAX_VALUE            | ""
    }
}
