package pl.allegro.finance.tradukisto.internal.languages.uzbek

import pl.allegro.finance.tradukisto.internal.languages.AbstractIntegerValuesTest

import static pl.allegro.finance.tradukisto.internal.Container.uzbekCyrillicContainer

class UzbekCyrillicIntegerValuesTest extends AbstractIntegerValuesTest {

    def setup() {
        intConverter = uzbekCyrillicContainer().getIntegerConverter()
    }

    @Override
    IntegerValuesTestData getTestData() {
        testData = new IntegerValuesTestData(integerTranslations)
    }

    private static integerTranslations = [
            0            : "нол",
            1            : "бир",
            2            : "икки",
            3            : "уч",
            4            : "тўрт",
            5            : "беш",
            6            : "олти",
            7            : "етти",
            8            : "саккиз",
            9            : "тўққиз",
            10           : "ўн",

            11           : "ўн бир",
            12           : "ўн икки",
            13           : "ўн уч",
            14           : "ўн тўрт",
            15           : "ўн беш",
            16           : "ўн олти",
            17           : "ўн етти",
            18           : "ўн саккиз",
            19           : "ўн тўққиз",

            20           : "йигирма",
            30           : "ўттиз",
            40           : "қирқ",
            50           : "эллик",
            60           : "олтмиш",
            70           : "етмиш",
            80           : "саксон",
            90           : "тўқсон",
            100          : "бир юз",

            200          : "икки юз",
            300          : "уч юз",
            400          : "тўрт юз",
            500          : "беш юз",
            600          : "олти юз",
            700          : "етти юз",
            800          : "саккиз юз",
            900          : "тўққиз юз",
            1000         : "бир минг",

            1_000_000    : "бир миллион",
            1_000_000_000: "бир миллиард",

            21           : "йигирма бир",
            37           : "ўттиз етти",
            43           : "қирқ уч",
            58           : "эллик саккиз",
            69           : "олтмиш тўққиз",
            76           : "етмиш олти",
            82           : "саксон икки",
            95           : "тўқсон беш",

            111          : "бир юз ўн бир",
            272          : "икки юз етмиш икки",
            387          : "уч юз саксон етти",
            448          : "тўрт юз қирқ саккиз",
            569          : "беш юз олтмиш тўққиз",
            625          : "олти юз йигирма беш",
            782          : "етти юз саксон икки",
            895          : "саккиз юз тўқсон беш",
            999          : "тўққиз юз тўқсон тўққиз",

            2_000        : "икки минг",
            3_000        : "уч минг",
            4_000        : "тўрт минг",
            5_000        : "беш минг",
            7_634        : "етти минг олти юз ўттиз тўрт",

            11_000       : "ўн бир минг",
            15_000       : "ўн беш минг",
            21_000       : "йигирма бир минг",
            24_190       : "йигирма тўрт минг бир юз тўқсон",
            653_000      : "олти юз эллик уч минг",
            123_454      : "бир юз йигирма уч минг тўрт юз эллик тўрт",
            700_000      : "етти юз минг",
            999_999      : "тўққиз юз тўқсон тўққиз минг тўққиз юз тўқсон тўққиз",

            2_000_000    : "икки миллион",
            5_000_000    : "беш миллион",
            23_437_219   : "йигирма уч миллион тўрт юз ўттиз етти минг икки юз ўн тўққиз",
            100_000_000  : "бир юз миллион",
            123_456_789  : "бир юз йигирма уч миллион тўрт юз эллик олти минг етти юз саксон тўққиз",
            322_089_890  : "уч юз йигирма икки миллион саксон тўққиз минг саккиз юз тўқсон",

            2_147_483_647: "икки миллиард бир юз қирқ етти миллион тўрт юз саксон уч минг олти юз қирқ етти"
    ]
}
