package pl.allegro.finance.tradukisto.internal.languages.hindi

import pl.allegro.finance.tradukisto.internal.languages.AbstractIntegerValuesTest

import static pl.allegro.finance.tradukisto.internal.Container.hindiContainer

class HindiIntegerValuesTest extends AbstractIntegerValuesTest {

    def setup() {
        intConverter = hindiContainer().getIntegerConverter()
    }

    @Override
    IntegerValuesTestData getTestData() {
        testData = new IntegerValuesTestData(integerTranslations)
    }

    private static integerTranslations = [
            0         : "शून्य",
            1         : "एक",
            2         : "दो",
            3         : "तीन",
            4         : "चार",
            5         : "पाँच",
            6         : "छ:",
            7         : "सात",
            8         : "आठ",
            9         : "नौ",

            11        : "ग्यारह",
            12        : "बारह",
            13        : "तेरह",
            14        : "चौदह",
            15        : "पंद्रह",
            16        : "सोलह",
            17        : "सत्रह",
            18        : "आट्ठारह",
            19        : "उन्नीस",

            10        : "दस",
            20        : "बीस",
            30        : "तीस",
            40        : "चालीस",
            50        : "पचास",
            60        : "साठ",
            70        : "सत्तर",
            80        : "असी",
            90        : "नब्बे",

            21        : "इक्कीस",
            37        : "सैंतीस",
            43        : "तैंतालीस",
            58        : "अट्ठावन",
            69        : "उनहत्तर",
            76        : "छीहत्तर",
            82        : "बयासी",
            95        : "पचानवे",

            100       : "एक सौ",
            200       : "दो सौ",
            300       : "तीन सौ",
            400       : "चार सौ",
            500       : "पाँच सौ",
            600       : "छ: सौ",
            700       : "सात सौ",
            800       : "आठ सौ",
            900       : "नौ सौ",

            111       : "एक सौ ग्यारह",
            272       : "दो सौ बहत्तर",
            387       : "तीन सौ सतासी",
            448       : "चार सौ अड़तालीस",
            569       : "पाँच सौ उनहत्तर",
            625       : "छ: सौ पच्चीस",
            782       : "सात सौ बयासी",
            895       : "आठ सौ पचानवे",
            999       : "नौ सौ निन्यानवे",

            1000      : "एक हजार",
            1234      : "एक हजार दो सौ चौंतीस",
            2000      : "दो हजार",
            3000      : "तीन हजार",
            4000      : "चार हजार",
            5000      : "पाँच हजार",
            7634      : "सात हजार छ: सौ चौंतीस",

            11000     : "ग्यारह हजार",
            15000     : "पंद्रह हजार",
            21000     : "इक्कीस हजार",
            24190     : "चौबीस हजार एक सौ नब्बे",
            653000    : "छ: लाख तिरपन हजार",
            123454    : "एक लाख तेईस हजार चार सौ चौवन",
            700000    : "सात लाख",
            999999    : "नौ लाख निन्यानवे हजार नौ सौ निन्यानवे",

            1000000   : "दस लाख",
            1001234   : "दस लाख एक हजार दो सौ चौंतीस",
            2000000   : "बीस लाख",
            5000000   : "पचास लाख",
            5012000   : "पचास लाख बारह हजार",
            23437219  : "दो करोड़ चौंतीस लाख सैंतीस हजार दो सौ उन्नीस",
            100000000 : "दस करोड़",
            100001200 : "दस करोड़ एक हजार दो सौ",
            123456789 : "बारह करोड़ चौंतीस लाख छप्पन हजार सात सौ नवासी",
            322089890 : "बत्तीस करोड़ बीस लाख नवासी हजार आठ सौ नब्बे",

            1000000000: "एक अरब",
            1000001234: "एक अरब एक हजार दो सौ चौंतीस",
            2147483647: "दो अरब चौदह करोड़ चौहत्तर लाख तिरासी हजार छ: सौ सैंतालीस"
    ]
}
