package pl.allegro.finance.tradukisto.internal.languages.urdu

import pl.allegro.finance.tradukisto.internal.languages.AbstractIntegerValuesTest

import static pl.allegro.finance.tradukisto.internal.Container.urduContainer

class UrduIntegerValuesTest extends AbstractIntegerValuesTest {
    def setup() {
        intConverter = urduContainer().getIntegerConverter()
    }

    @Override
    IntegerValuesTestData getTestData() {
        testData = new IntegerValuesTestData(integerTranslations)
    }

    private static integerTranslations = [
            0         : "صفر",
            1         : "ایک",
            2         : "دو",
            3         : "تین",
            4         : "چار",
            5         : "پانچ",
            6         : "چھ",
            7         : "سات",
            8         : "آٹھ",
            9         : "نو",

            11        : "گیارہ",
            12        : "بارہ",
            13        : "تیرہ",
            14        : "چودہ",
            15        : "پندرہ",
            16        : "سولہ",
            17        : "سترہ",
            18        : "اٹھارہ",
            19        : "انیس",

            10        : "دس",
            20        : "بیس",
            30        : "تیس",
            40        : "چالیس",
            50        : "پچاس",
            60        : "ساٹھ",
            70        : "ستر",
            80        : "اسی",
            90        : "نوے",

            21        : "اکیس",
            37        : "سینتیس",
            43        : "تینتالیس",
            58        : "اٹھاون",
            69        : "انہتر",
            76        : "چھہتر",
            82        : "بیاسی",
            95        : "پچانوے",

            100       : "ایک سو",
            200       : "دو سو",
            300       : "تین سو",
            400       : "چار سو",
            500       : "پانچ سو",
            600       : "چھ سو",
            700       : "سات سو",
            800       : "آٹھ سو",
            900       : "نو سو",

            111       : "ایک سو گیارہ",
            272       : "دو سو بہتر",
            387       : "تین سو ستاسی",
            448       : "چار سو اڑتالیس",
            569       : "پانچ سو انہتر",
            625       : "چھ سو پچیس",
            782       : "سات سو بیاسی",
            895       : "آٹھ سو پچانوے",
            999       : "نو سو ننانوے",

            1000      : "ایک ہزار",
            1234      : "ایک ہزار دو سو چونتیس",
            2000      : "دو ہزار",
            3000      : "تین ہزار",
            4000      : "چار ہزار",
            5000      : "پانچ ہزار",
            7634      : "سات ہزار چھ سو چونتیس",

            11000     : "گیارہ ہزار",
            15000     : "پندرہ ہزار",
            21000     : "اکیس ہزار",
            24190     : "چوبیس ہزار ایک سو نوے",
            653000    : "چھ لاکھ ترپن ہزار",
            123454    : "ایک لاکھ تئیس ہزار چار سو چون",
            700000    : "سات لاکھ",
            999999    : "نو لاکھ ننانوے ہزار نو سو ننانوے",

            1000000   : "دس لاکھ",
            1001234   : "دس لاکھ ایک ہزار دو سو چونتیس",
            2000000   : "بیس لاکھ",
            5000000   : "پچاس لاکھ",
            5012000   : "پچاس لاکھ بارہ ہزار",
            23437219  : "دو کروڑ چونتیس لاکھ سینتیس ہزار دو سو انیس",
            100000000 : "دس کروڑ",
            100001200 : "دس کروڑ ایک ہزار دو سو",
            123456789 : "بارہ کروڑ چونتیس لاکھ چھپن ہزار سات سو نواسی",
            322089890 : "بتیس کروڑ بیس لاکھ نواسی ہزار آٹھ سو نوے",

            1000000000: "ایک ارب",
            1000001234: "ایک ارب ایک ہزار دو سو چونتیس",
            2147483647: "دو ارب چودہ کروڑ چوہتر لاکھ تراسی ہزار چھ سو سینتالیس"
    ]
}
