package pl.allegro.finance.tradukisto.internal.languages.kazakh

import pl.allegro.finance.tradukisto.internal.languages.AbstractIntegerValuesTest

import static pl.allegro.finance.tradukisto.internal.Container.kazakhContainer

class KazakhIntegerValuesTest extends AbstractIntegerValuesTest {

    def setup() {
        intConverter = kazakhContainer().getIntegerConverter()
    }

    @Override
    IntegerValuesTestData getTestData() {
        testData = new IntegerValuesTestData(integerTranslations)
    }

    private static integerTranslations = [
            0            : "нөл",
            1            : "бір",
            2            : "екі",
            3            : "үш",
            4            : "төрт",
            5            : "бес",
            6            : "алты",
            7            : "жеті",
            8            : "сегіз",
            9            : "тоғыз",
            10           : "он",

            11           : "он бір",
            12           : "он екі",
            13           : "он үш",
            14           : "он төрт",
            15           : "он бес",
            16           : "он алты",
            17           : "он жеті",
            18           : "он сегіз",
            19           : "он тоғыз",

            20           : "жиырма",
            30           : "отыз",
            40           : "қырық",
            50           : "елу",
            60           : "алпыс",
            70           : "жетпіс",
            80           : "сексен",
            90           : "тоқсан",
            100          : "жүз",

            200          : "екі жүз",
            300          : "үш жүз",
            400          : "төрт жүз",
            500          : "бес жүз",
            600          : "алты жүз",
            700          : "жеті жүз",
            800          : "сегіз жүз",
            900          : "тоғыз жүз",
            1000         : "бір мың",

            1_000_000    : "бір миллион",
            1_000_000_000: "бір миллиард",

            21           : "жиырма бір",
            34           : "отыз төрт",
            55           : "елу бес",
            89           : "сексен тоғыз",
            144          : "жүз қырық төрт",
            233          : "екі жүз отыз үш",
            377          : "үш жүз жетпіс жеті",
            610          : "алты жүз он",
            987          : "тоғыз жүз сексен жеті",
            1_597        : "бір мың бес жүз тоқсан жеті",
            2_584        : "екі мың бес жүз сексен төрт",
            4_181        : "төрт мың жүз сексен бір",
            6_765        : "алты мың жеті жүз алпыс бес",
            10_946       : "он мың тоғыз жүз қырық алты",
            17_711       : "он жеті мың жеті жүз он бір",
            28_657       : "жиырма сегіз мың алты жүз елу жеті",
            46_368       : "қырық алты мың үш жүз алпыс сегіз",
            75_025       : "жетпіс бес мың жиырма бес",
            121_393      : "жүз жиырма бір мың үш жүз тоқсан үш",
            196_418      : "жүз тоқсан алты мың төрт жүз он сегіз",
            317_811      : "үш жүз он жеті мың сегіз жүз он бір",
            514_229      : "бес жүз он төрт мың екі жүз жиырма тоғыз",
            832_040      : "сегіз жүз отыз екі мың қырық",
            1_346_269    : "бір миллион үш жүз қырық алты мың екі жүз алпыс тоғыз",
            2_178_309    : "екі миллион жүз жетпіс сегіз мың үш жүз тоғыз",

            1_836_311_903: "бір миллиард сегіз жүз отыз алты миллион үш жүз он бір мың тоғыз жүз үш"
    ]
}
